mapping_groupName_groupCode = {
    "Беляево":33,
    "Хорошёво":39
}


mapping_groupName_Time = {
    "Беляево":"16:55",
    "Хорошёво":"10:20"
}


mapping_studentId_studentFullName = {
    1:"Макарычев Иван  Алекс",
    2:"Борисов  Олег Михайлович",
    20:"Сергеев Артем Дмитриевич",
    37:"Лукьянов Андрей Вячеславович",
    117:"Шагинов Владимир Евгеньевич",
    118:"Маркевич Артём Сергеевич",
    139:"Агеев  Константин Владимирович"
}


mapping_studentId_studentName = {
    1:" Иван",
    2:"  Олег",
    20:" Артем",
    37:" Андрей",
    117:" Владимир",
    118:" Артём",
    139:"  Константин"
}


mapping_studentKey_studentId = {
    "Хорошёво":{
        "Макарычев Иван  Алекс":1,
        "Ваня":1,
        "Иван":1,
        "Лукьянов Андрей Вячеславович":37,
        "Андрей":37,
        "Шагинов Владимир Евгеньевич":117,
        "Вова":117,
        "Маркевич Артём Сергеевич":118,
        "Артем":118,
        "Артём":118,
        "Агеев  Константин Владимирович":139,
        "Костя":139,

        "Никита": -1, # какой-то непонятно откуда взявшийся перец
        'Шубина Нелли Валерьевна':-2 # и такая же перчиха
    },
    "Беляево":{
        "Борисов  Олег Михайлович":2,
        "Олег":2,
        "Сергеев Артем Дмитриевич":20,
        "Артем":20,
        "Артём":20
    }
}